In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import pandas as pd  
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100
'''
with engine.connect() as connection:
    result = connection.execute(text(query))

In [5]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-06-29 17:18:45.283,36.164508,-86.781079,PoweredPAVHVTUPMTOOG,Powered,100.0,scooter,0.15,Lime
1,2019-06-29 17:18:45.283,36.170227,-86.789251,PoweredHU5MHB6HC25EY,Powered,66.0,scooter,0.15,Lime
2,2019-06-29 17:18:45.283,36.170418,-86.784328,PoweredQC2RYIATF7UW2,Powered,89.0,scooter,0.15,Lime
3,2019-06-29 17:18:45.283,36.172003,-86.785859,PoweredQZBS2Q665476B,Powered,100.0,scooter,0.15,Lime
4,2019-06-29 17:18:45.283,36.164247,-86.790481,PoweredF373JJDJRLUVK,Powered,61.0,scooter,0.15,Lime

In [6]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [7]:
query = '''
SELECT companyname, Count(*)
FROM scooters 
group by companyname;
'''
counts = pd.read_sql_query(query, engine)
counts

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16524261
5        Lyft   9087043
6        Spin   5559573

In [8]:
TRIP = '''
SELECT *
FROM TRIPS 
LIMIT 100
'''
TRIPSVAL = pd.read_sql_query(TRIP, engine)
TRIPSVAL.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-06-15 15:21:37.880,Bird,BRD528,PoweredSWZPX,10.000000,0.0000,2019-06-15,15:12:07.136666,2019-06-15,15:21:55.873333,36.15310,-86.80470,36.15140,-86.78710,"[(36.153163, -86.804671), (36.153113, -86.8048...",2019-06-16 05:31:19.423
1,2019-06-15 15:21:37.880,Bird,BRD530,PoweredS3R37,17.000000,0.0000,2019-06-15,15:06:18.120000,2019-06-15,15:23:14.766666,36.14540,-86.81140,36.14630,-86.81220,"[(36.145451, -86.811302), (36.145466, -86.8113...",2019-06-16 05:31:19.483
2,2019-06-15 15:21:37.880,Bird,BRD526,Powered1EUQX,6.000000,1640.4200,2019-06-15,15:17:03.433333,2019-06-15,15:22:34.990000,36.16400,-86.78080,36.16420,-86.78050,"[(36.164294, -86.780462)]",2019-06-16 05:31:19.360
3,2019-06-15 15:21:37.880,Bird,BRD529,PoweredVEBYE,15.000000,4265.0920,2019-06-15,15:07:38.200000,2019-06-15,15:22:32.520000,36.15790,-86.78370,36.15970,-86.77490,"[(36.157945, -86.783659), (36.158244, -86.7834...",2019-06-16 05:31:19.453
4,2019-06-15 15:21:46.303,Lyft,LFT934,Powered064138,1.595583,262.4672,2019-06-15,15:20:10.440000,2019-06-15,15:21:46.176666,36.18937,-86.74604,36.18889,-86.74602,"[(36.18937, -86.74604), (36.18944, -86.74602),...",2019-06-16 08:55:43.927

In [9]:
SUMIDS = '''
SELECT SUMDID
FROM trips
GROUP BY SUMDID
ORDER BY SUMDID
'''
SUMIDSTRIP = pd.read_sql_query(SUMIDS, engine)
SUMIDSTRIP

                                            sumdid
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c
...                                            ...
9000                                  PoweredZZFGD
9001                          PoweredZZNTWU4QI7MLI
9002                          PoweredZZQ7FMUUD6ULV
9003                          PoweredZZQOO54WD4AJT
9004                         StandardLIRPOZ7X3ZVGO

[9005 rows x 1 columns]

In [10]:
MINLATLON = '''
SELECT 'SCOOTER'TABLE_NAME,MIN(latitude) MIN_LAT,MAX(latitude) MAX_LAT,MIN(longitude) MIN_LON, MAX(longitude) MAX_LON 
FROM scooters 
UNION 
SELECT 'TRIPS'TABLE_NAME, MIN(startlatitude) MIN_LAT,MAX(endlatitude) MAX_LAT,MIN(endlongitude) MIN_LON, MAX(endlongitude) MAX_LON 
FROM trips 
'''
LATLON = pd.read_sql_query(MINLATLON, engine)
LATLON

  table_name  min_lat       max_lat     min_lon     max_lon
0    SCOOTER   0.0000  3.609874e+06  -97.443879    0.000000
1      TRIPS  35.8532  5.104541e+01 -122.673729  174.764886

In [11]:
SUMGRP ='''
SELECT SUMDGROUP
FROM scooters 
GROUP BY SUMDGROUP
'''

GROUPTYPE = pd.read_sql_query(SUMGRP, engine)
GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

1A. How many scooters did each company have in this time frame

In [12]:
TOTALSCOOTERS = '''
SELECT COMPANYNAME,
COUNT(DISTINCT(SUMDID)) COUNTS
FROM scooters TABLESAMPLE SYSTEM (1)
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
COMPANYNAME
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

  companyname  counts
0        Bird    3753
1        Bolt     355
2      Gotcha     224
3        Jump    1210
4        Lime    1790
5        Lyft    1710
6        Spin     784

In [13]:
1B. Did the number for each company change over time?

In [14]:
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP) SUMDGROUP,
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS TABLESAMPLE SYSTEM (1)
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)
SCOOTERSONLY1

   sumdgroup companyname month_num month_name year_val  count
0    SCOOTER        BIRD        05  MAY           2019   2934
1    SCOOTER        BIRD        06  JUNE          2019   2820
2    SCOOTER        BIRD        07  JULY          2019   2444
3    SCOOTER        BOLT        05  MAY           2019    344
4    SCOOTER        BOLT        06  JUNE          2019    327
5    SCOOTER        BOLT        07  JULY          2019    272
6    SCOOTER      GOTCHA        05  MAY           2019    223
7    SCOOTER      GOTCHA        06  JUNE          2019    223
8    SCOOTER      GOTCHA        07  JULY          2019    224
9    SCOOTER        JUMP        05  MAY           2019    975
10   SCOOTER        JUMP        06  JUNE          2019   1036
11   SCOOTER        JUMP        07  JULY          2019   1206
12   SCOOTER        LIME        05  MAY           2019   1606
13   SCOOTER        LIME        06  JUNE          2019   1436
14   SCOOTER        LIME        07  JULY          2019    870
15   SCOOTER        LYFT        05  MAY           2019   1347
16   SCOOTER        LYFT        06  JUNE          2019   1132
17   SCOOTER        LYFT        07  JULY          2019   1014
18   SCOOTER        SPIN        05  MAY           2019    672
19   SCOOTER        SPIN        06  JUNE          2019    704
20   SCOOTER        SPIN        07  JULY          2019    551

1C. Did scooter usage vary by company?

In [15]:
TRIPSTESTSPEED ='''
SELECT *
FROM TRIPS TABLESAMPLE SYSTEM (1)
'''
SPEEDTESTTRIP= pd.read_sql_query(TRIPSTESTSPEED , engine)
SPEEDTESTTRIP

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 02:02:48.720,Lyft,LFT182,Powered599092,4.719767,3218.50404,2019-05-01,01:58:05.436666,2019-05-01,02:02:48.623333,36.152950,-86.790180,36.14833,-86.798890,"[(36.15295, -86.79018), (36.15298, -86.79013),...",2019-05-02 07:20:38.950
1,2019-05-01 02:03:08.680,Lyft,LFT183,Powered329418,10.002617,3166.01060,2019-05-01,01:53:08.396666,2019-05-01,02:03:08.556666,36.151900,-86.784320,36.15822,-86.784180,"[(36.1519, -86.78432), (36.15196, -86.78448), ...",2019-05-02 07:20:38.980
2,2019-05-01 02:03:14.177,Lyft,LFT184,Powered987267,9.429633,3166.01060,2019-05-01,01:53:48.246666,2019-05-01,02:03:14.023333,36.151840,-86.784420,36.15819,-86.784190,"[(36.15184, -86.78442), (36.15192, -86.78447),...",2019-05-02 07:20:39.010
3,2019-05-01 02:03:53.403,Lyft,LFT185,Powered741719,2.828467,1423.88456,2019-05-01,02:01:03.576666,2019-05-01,02:03:53.283333,36.170010,-86.784730,36.16915,-86.781000,"[(36.17001, -86.78473), (36.17011, -86.78466),...",2019-05-02 07:20:39.043
4,2019-05-01 02:04:07.317,Lyft,LFT186,Powered816105,12.944017,9025.59084,2019-05-01,01:51:10.570000,2019-05-01,02:04:07.210000,36.170980,-86.785410,36.15850,-86.789240,"[(36.17098, -86.78541), (36.17096, -86.78536),...",2019-05-02 07:20:39.073
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5175,2019-07-31 20:10:13.850,Lyft,LFT500,Powered849147,3.088950,52.49344,2019-07-31,20:07:08.393333,2019-07-31,20:10:13.730000,36.172840,-86.791530,36.17280,-86.791560,"[(36.17284, -86.79153), (36.17285, -86.79159),...",2019-08-01 10:35:26.137
5176,2019-07-31 20:11:24.033,Lyft,LFT501,Powered482126,6.237583,2956.03684,2019-07-31,20:05:09.660000,2019-07-31,20:11:23.916666,36.154900,-86.785720,36.15133,-86.794490,"[(36.1549, -86.78572), (36.15481, -86.78594), ...",2019-08-01 10:35:26.170
5177,2019-07-31 20:12:19.127,Lyft,LFT502,Powered299463,6.942783,6968.50416,2019-07-31,20:05:22.180000,2019-07-31,20:12:18.746666,36.176260,-86.785600,36.16145,-86.777520,"[(36.17626, -86.7856), (36.17625, -86.78566), ...",2019-08-01 10:35:26.203
5178,2019-07-31 20:13:07.000,Bolt Mobility,BOL00058,Powered-9453be36-10ed-1c75-3d8a-32b8b6664629,1721.000000,13733.60000,2019-07-31,19:41:58,2019-07-31,20:10:39,36.160934,-86.777056,36.14971,-86.797084,"[('36.160934', '-86.777056'), ('36.160944', '-...",2019-08-01 06:24:13.473
5179,2019-07-31 23:07:12.073,Lyft,LFT727,Powered929790,8.350533,3323.49092,2019-07-31,22:58:50.923333,2019-07-31,23:07:11.956666,36.145300,-86.792770,36.15157,-86.796890,"[(36.1453, -86.79277), (36.14536, -86.79281), ...",2019-08-01 10:35:33.970

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours

In [16]:
TRIPSCOOTER = '''
SELECT 'OVER 24 HRS' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'UNDER 1 MINUTE' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status DESC,companyname
'''
scooterstriptime= pd.read_sql_query(TRIPSCOOTER, engine)
scooterstriptime

           status    companyname
0  UNDER 1 MINUTE           BIRD
1  UNDER 1 MINUTE           LIME
2  UNDER 1 MINUTE           LYFT
3     OVER 24 HRS  BOLT MOBILITY
4     OVER 24 HRS           LYFT
5     OVER 24 HRS           SPIN

Are the scooter companies in compliance with the second and third part of this rule?

In [17]:
COMPLIANCE ='''
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS WHERE  UPPER(companyname) NOT IN 
(SELECT  COMPANYNAME FROM
(
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
UNION
SELECT 
UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1) 
GROUP BY COMPANYNAME)
GROUP BY
UPPER(companyname) 
'''
COMPLIANT= pd.read_sql_query(COMPLIANCE, engine)
COMPLIANT

  companyname
0      GOTCHA
1        JUMP

In [41]:
SCOOTERUSAGE = '''
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNT
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) >1
ORDER BY STARTDATE,UPPER(COMPANYNAME)
'''
USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

,companyname,startdate,sumdid,count
0,BIRD,2019-05-02,PoweredQ8MT6,2
1,LIME,2019-05-02,PoweredOIAXAHMOFTKWL,2
2,BIRD,2019-05-04,PoweredUK4PT,2
3,LIME,2019-05-04,PoweredARSB7JNQS7WJQ,2
4,LIME,2019-05-04,PoweredLYW2EXJ6PHFTH,2
...,...,...,...,...
130,BIRD,2019-07-07,PoweredKCPYQ,2
131,LYFT,2019-07-13,Powered885391,2
132,BIRD,2019-07-19,Powered4E3Q1,2
133,JUMP,2019-07-21,Poweredcd592368-5741-57f2-9664-e2b1c89884ef,2
134,BIRD,2019-07-29,Powered1R52Y,2